src/app/controllers/post_controller.rb

    def list
        @posts = Post.all
---
SELECT "posts".* FROM "posts"

    def new
        @post = Post.new
        @subjects = Subject.all
---
SELECT "subjects".* FROM "subjects"